# PlaceGroupFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..PlaceGroupFailed Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to place group instances.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PlaceGroupFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlaceGroupFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PlaceGroupFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace